package auto.lib.man;

import java.util.ArrayList;

import auto.lib.random.*;

public class ManUtils {
	
	static String[] ttkUserNameList = {
			"曹操","曹丕","曹睿","曹芳","曹髦","曹奂","曹仁","曹洪","曹纯","曹真","曹休","曹爽","曹植","曹昂","曹彰","曹冲","曹羲","曹训","曹彦","夏侯渊","夏侯敦","夏侯茂","夏侯衡","夏侯霸","夏侯称","夏侯威","夏侯荣","夏侯惠","夏侯和","夏侯尚","夏侯玄","司马懿","司马师","司马昭","钟会","邓艾","羊祜","杜预","王浚","唐彬","郭淮","许褚","典韦","张辽","臧霸","鲜于辅","徐质","徐晃","王基","文聘","张郃","胡遵","孙观","吕虔","乐进","于禁","朱灵","车胄","徐邈","李通","孙礼","陈骞","申仪","申耽","庞德","庞会","李典","吕昭","阎柔","贾逵","田豫","秦朗","王双","前部大先锋","高览","郭嘉","贾诩","蒋济","满宠","辛敞","程昱","钟繇","华歆","王朗","王肃","贾充","杜畿","杜袭","傅嘏","毛玠","杨彪","刘劭","山涛","郭修","王戎","韩暨","董昭","陈矫","荀攸","荀彧","荀顗","温恢","张既","李立","刘馥","刘晔","孔融","孟建","卫瓘","陈登","华表","杨济","张华","裴秀","高堂隆","蒯越","杨阜","李丰","徐奕","邢颙","薛悌","鲍勋","冯紞","许攸","陈群","陈泰","何晏","刘靖","丁仪","丁廙","向秀","管宁","杨修","刘桢","傅干","石韬","蒋干","管辂","杜夔","王粲","徐干","陈琳","阮咸","阮瑀","阮籍","应玚","嵇康","刘伶","姓名","刘备","刘禅","刘永","刘理","刘谌","诸葛亮","庞统","关羽","张飞","赵云","马超","黄忠","姜维","魏延","马岱","关兴","张苞","关平","廖化","张翼","王平","陈到","吴懿","吴班","李严","胡济","蒋斌","诸葛瞻","罗宪","马忠","李恢","刘敏","邓芝","张嶷","高翔","辅匡","阎宇","句扶","向宠","刘琰","赵统","杨戏","诸葛乔","刘邕","邓方","霍弋","李球","赵累","黄权","傅佥","刘封","霍峻","冯习","张南","刘巴","吕乂","黄崇","张遵","陈式","严颜","徐庶","蒋琬","费祎","董厥","陈祗","李福","法正","宗预","向朗","王连","费观","孙乾","简雍","糜竺","来敏","伊籍","杨洪","张裔","董允","卫继","李撰","杨颙","谯周","张绍","邓良","郤正","廖立","王甫","杨仪","费诗","杜微","五梁","刘豹","向举","尹默","董和","许靖","马良","王谋","杜琼","秦宓","孟光","许慈","何宗","韩冉","周群","陈震","程畿","樊建","殷观","陈寿","孟达","射援","射坚","李密","吕凯","庞宏","王伉","马谡","彭羕","黄皓","孙权","孙亮","孙休","孙皓","孙坚","孙策","孙和","孙邵","孙峻","顾雍","陆逊","步鹭","滕胤","张悌","周瑜","鲁肃","吕蒙","孙韶","孙桓","孙静","孙瑜","孙皎","孙贲","孙翊","朱然","全琮","程普","甘宁","周泰","蒋钦","丁奉","徐盛","潘璋","诸葛靓","留赞","施绩","吕岱","朱治","鲁淑","虞汜","贺齐","张承","钟离牧","太史慈","韩当","沈莹","黄盖","祖茂","凌统","董袭","陈武","吕范","步阐","步玑","楼玄","张昭","张休","华核","胡综","陆抗","阚泽","是仪","桓阶","全尚","潘浚","顾谭","士燮","朱据","陆景","骆统","严畯","诸葛诞","诸葛瑾","诸葛恪","陆绩","张纮","张温","虞翻","刘基","程秉","薛综","吾粲","姓名","刘协","袁绍","袁术","刘表","鲁恭王刘佘后代","刘璋","鲁恭王刘佘后代","马腾","吕布","公孙瓒","张绣","张鲁","张燕","张杨","陶谦","刘繇","刘虞","刘岱","鲍信","韩馥","公孙度","公孙恭","公孙渊","韩遂","孔伷","董卓","张邈","卢植","何进","朱皓","王允","皇甫嵩","颜良","文丑","审配","逢纪","田丰","沮授","蔡瑁","祢衡","诸葛玄","许劭","刘焉","王累","张任","张松","马铁","马休","严象","郑泰","田楷","单经","严纲","张闿","董旻","李傕","华雄","李儒","蔡邕","陈宫","张角","张宝","张梁","华佗","董奉","张机","陈翔","范滂","孔昱","范康","檀敷","张俭","皇甫谧","左慈","黄承彦","司马徽","孟获","沙摩柯","轲比能","楼班","强端","蹋顿"
	};
	static String[] cityNameList = {
			"北京市","广东省","山东省","江苏省","河南省","上海市","河北省","浙江省","香港特别行政区","陕西省","湖南省","重庆市","福建省","天津市","云南省","四川省","广西壮族自治区","安徽省","海南省","江西省","湖北省","山西省","辽宁省","台湾省","黑龙江","内蒙古自治区","澳门特别行政区","贵州省","甘肃省","青海省","新疆维吾尔自治区","西藏区","吉林省","宁夏回族自治区","东莞市","广州市","中山市","深圳市","惠州市","江门市","珠海市","汕头市","佛山市","湛江市","河源市","肇庆市","潮州市","清远市","韶关市","揭阳市","阳江市","云浮市","茂名市","梅州市","汕尾市","济南市","青岛市","临沂市","济宁市","菏泽市","烟台市","泰安市","淄博市","潍坊市","日照市","威海市","滨州市","东营市","聊城市","德州市","莱芜市","枣庄市","苏州市","徐州市","盐城市","无锡市","南京市","南通市","连云港市","常州市","扬州市","镇江市","淮安市","泰州市","宿迁市","郑州市","南阳市","新乡市","安阳市","洛阳市","信阳市","平顶山市","周口市","商丘市","开封市","焦作市","驻马店市","濮阳市","三门峡市","漯河市","许昌市","鹤壁市","济源市","石家庄市","唐山市","保定市","邯郸市","邢台市","河北区","沧州市","秦皇岛市","张家口市","衡水市","廊坊市","承德市","温州市","宁波市","杭州市","台州市","嘉兴市","金华市","湖州市","绍兴市","舟山市","丽水市","衢州市","西安市","咸阳市","宝鸡市","汉中市","渭南市","安康市","榆林市","商洛市","延安市","铜川市","长沙市","邵阳市","常德市","衡阳市","株洲市","湘潭市","永州市","岳阳市","怀化市","郴州市","娄底市","益阳市","张家界市","湘西州","漳州市","泉州市","厦门市","福州市","莆田市","宁德市","三明市","南平市","龙岩市","江北区","渝北区","沙坪坝区","九龙坡区","万州区","永川市","南岸区","酉阳县","北碚区","涪陵区","秀山县","巴南区","渝中区","石柱县","忠县","合川市","大渡口区","开县","长寿区","荣昌县","云阳县","梁平县","潼南县","江津市","彭水县","璧山县","綦江县","大足县","黔江区","巫溪县","巫山县","垫江县","丰都县","武隆县","万盛区","铜梁县","南川市","奉节县","双桥区","城口县","和平区","北辰区","河北区","河西区","西青区","津南区","东丽区","武清区","宝坻区","红桥区","大港区","汉沽区","静海县","宁河县","塘沽区","蓟县","南开区","河东区","昆明市","红河州","大理州","文山州","德宏州","曲靖市","昭通市","楚雄州","保山市","玉溪市","丽江地区","临沧地区","思茅地区","西双版纳州","怒江州","迪庆州","成都市","绵阳市","广元市","达州市","南充市","德阳市","广安市","阿坝州","巴中市","遂宁市","内江市","凉山州","攀枝花市","乐山市","自贡市","泸州市","雅安市","宜宾市","资阳市","眉山市","甘孜州","贵港市","玉林市","北海市","南宁市","柳州市","桂林市","梧州市","钦州市","来宾市","河池市","百色市","贺州市","崇左市","防城港市","芜湖市","合肥市","六安市","宿州市","阜阳市","安庆市","马鞍山市","蚌埠市","淮北市","淮南市","宣城市","黄山市","铜陵市","亳州市","池州市","巢湖市","滁州市","三亚市","海口市","琼海市","文昌市","东方市","昌江县","陵水县","乐东县","五指山市","保亭县","澄迈县","万宁市","儋州市","临高县","白沙县","定安县","琼中县","屯昌县","南昌市","赣州市","上饶市","吉安市","九江市","新余市","抚州市","宜春市","景德镇市","萍乡市","鹰潭市武汉市","宜昌市","襄樊市","荆州市","恩施州","孝感市","黄冈市","十堰市","咸宁市","黄石市","仙桃市","随州市","天门市","荆门市","潜江市","鄂州市","神农架林区","太原市","大同市","运城市","长治市","晋城市","忻州市","临汾市","吕梁市","晋中市","阳泉市","朔州市","大连市","沈阳市","丹东市","辽阳市","葫芦岛市","锦州市","朝阳市","营口市","鞍山市","抚顺市","阜新市","本溪市","盘锦市","铁岭市","台北市","高雄市","台中市","新竹市","基隆市","台南市","嘉义市","齐齐哈尔市","哈尔滨市","大庆市","佳木斯市","双鸭山市","牡丹江市","鸡西市","黑河市","绥化市","鹤岗市","伊春市","大兴安岭地区","七台河市","赤峰市","包头市","通辽市","呼和浩特市","乌海市","鄂尔多斯市","呼伦贝尔市","兴安盟","巴彦淖尔盟","乌兰察布盟","锡林郭勒盟","阿拉善盟","贵阳市","黔东南州","黔南州","遵义市","黔西南州","毕节地区","铜仁地区","安顺市","六盘水市","兰州市","天水市","庆阳市","武威市","酒泉市","张掖市","陇南地区","白银市","定西地区","平凉市","嘉峪关市","临夏回族自治州","金昌市","甘南州","西宁市","海西州","海东地区","海北州","果洛州","玉树州","黄南藏族自治州","乌鲁木齐市","伊犁州","昌吉州","石河子市","哈密地区","阿克苏地区","巴音郭楞州","喀什地区","塔城地区","克拉玛依市","和田地区","阿勒泰州","吐鲁番地区","阿拉尔市","博尔塔拉州","五家渠市","克孜勒苏州","图木舒克市","拉萨市","山南地区","林芝地区","日喀则地区","阿里地区","昌都地区","那曲地区","吉林市","长春市","白山市","白城市","延边州","松原市","辽源市","通化市","四平市","银川市","吴忠市","中卫市","石嘴山市","固原市"
	};
	//the Three Kingdoms (220-265), namely, Wei（魏，220-265), Shu Han (蜀汉, 221-263) and Wu (吴, 222-280)
	public static String ttkName(){
		return RandomUtils.getRandomString(ttkUserNameList);	
	}
	public static ArrayList<String> ttkNames(int n){
		ArrayList<String> strs = new ArrayList<String>();
		
        while (n>0) {
            strs.add(RandomUtils.getRandomString(ttkUserNameList));
            n--;
        }
        return strs;
	}
	
	public static String cityName(){
		return RandomUtils.getRandomString(cityNameList);
	}
	
	public static void main(String[] args) {
		
		System.out.println(ManUtils.ttkName());
		System.out.println(ManUtils.ttkNames(3));
		System.out.println(ManUtils.cityName());
	}
}
